# RebarShapeConstraint180DegreeBendArcLength Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarShapeConstraint180DegreeBendArcLength Members
RebarShapeConstraint180DegreeBendArcLength Class Constructors Methods Properties See Also
---
The RebarShapeConstraint180DegreeBendArcLength type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RebarShapeConstraint180DegreeBendArcLength | Create a 180-degree bend constraint driven by arc length. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from RebarShapeConstraint.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetParamId | Return the Id of the parameter associated with this constraint.  (Inherited from RebarShapeConstraint.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RebarShapeConstraint.) |

# See Also
RebarShapeConstraint180DegreeBendArcLength Class
Autodesk.Revit.DB.Structure Namespace